tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'

brew 'archey'
brew 'fzf'
brew 'ghi'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'imagemagick'
brew 'imageoptim-cli'
brew 'mas'
brew 'python'
brew 'tig'
brew 'tree'
brew 'watchman'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'
brew 'z'

cask 'alfred'
cask 'atom'
cask 'dash'
cask 'dozer'
cask 'dropbox'
cask 'discord'
cask 'figma'
cask 'firefox-developer-edition'
cask 'flux'
cask 'github'
cask 'google-chrome' # for react-native debugging
cask 'google-chrome-canary'
cask 'imageoptim'
cask 'iterm2'
cask 'name-mangler'
cask 'ndm'
cask 'recordit'
cask 'rightfont'
cask 'signal'
cask 'spotify'
cask 'sublime-text'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'

# Use JAVA 8 which is the stablest version for Android.
# https://stackoverflow.com/questions/53059771/could-not-determine-java-version-from-11-0-1-when-running-npm-run-android
cask 'java8'
brew 'gradle'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
