#!/usr/bin/env bash

# Install command-line tools using Homebrew.

# Make sure we’re using the latest Homebrew.
brew update

# Upgrade any already-installed formulae.
brew upgrade



tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'archey'
brew 'bat'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'imagemagick'
brew 'imageoptim-cli'
brew 'nvm'
brew 'python'
brew 'tree'
# brew 'yarn'
brew 'youtube-dl'
brew 'z'



# React Native Development Setup

tap 'facebook/fb'
brew 'idb-companion' # automating iOS simulators and devices

brew 'expo-orbit'
brew 'fastlane'
brew 'mas' # Mac App Store command line interface
brew 'watchman'

# cask 'alfred'
cask 'arc'
cask 'around'
cask 'brave-browser'
cask 'discord'
cask 'dropbox'
cask 'elgato-wave-link'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'quik'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
# cask 'ndm'
cask 'microsoft-teams'
cask 'notion'
# cask 'rectangle-pro'
cask 'screaming-frog-seo-spider'
cask 'setapp'
cask 'obs'
cask 'raycast'
cask 'stremio'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'visual-studio-code'
cask 'visual-studio-insiders'
cask 'vlc'
cask 'zoomus'


# React Native Development Setup for Android

# The Zulu OpenJDK distribution offers JDKs for both Intel and M1 Macs.
# This will make sure your build are faster on M1 Macs compared to using an Intel-based JDK.
# https://reactnative.dev/docs/environment-setup#installing-dependencies
# cask 'zulu11'

# brew 'gradle'
# cask 'android-file-transfer'
# cask 'android-platform-tools'
# cask 'android-sdk'
# cask 'android-studio'


# Remove outdated versions from the cellar.
brew cleanup
